evaluation/wrk2_control_no_deploy_20260802_000309.txt
Running 2m test @ http://127.0.0.1:8090
  4 threads and 20 connections
  Thread calibration: mean lat.: 14.009ms, rate sampling interval: 45ms
  Thread calibration: mean lat.: 13.873ms, rate sampling interval: 36ms
  Thread calibration: mean lat.: 13.320ms, rate sampling interval: 44ms
  Thread calibration: mean lat.: 13.993ms, rate sampling interval: 43ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    12.67ms   24.93ms 324.35ms   89.76%
    Req/Sec    12.52     30.31   142.00     87.72%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    5.17ms
 75.000%    6.90ms
 90.000%   41.63ms
 99.000%  113.66ms
 99.900%  184.06ms
 99.990%  324.61ms
 99.999%  324.61ms
100.000%  324.61ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       1.483     0.000000            1         1.00
       2.425     0.100000          399         1.11
       2.825     0.200000          797         1.25
       3.245     0.300000         1195         1.43
       4.115     0.400000         1594         1.67
       5.167     0.500000         1994         2.00
       5.527     0.550000         2191         2.22
       5.831     0.600000         2390         2.50
       6.155     0.650000         2592         2.86
       6.451     0.700000         2789         3.33
       6.899     0.750000         2989         4.00
       7.279     0.775000         3088         4.44
       7.731     0.800000         3187         5.00
       8.303     0.825000         3286         5.71
       9.351     0.850000         3386         6.67
      11.031     0.875000         3486         8.00
      13.759     0.887500         3535         8.89
      41.631     0.900000         3586        10.00
      52.639     0.912500         3635        11.43
      61.471     0.925000         3685        13.33
      67.839     0.937500         3735        16.00
      71.295     0.943750         3759        17.78
      75.199     0.950000         3785        20.00
      78.911     0.956250         3809        22.86
      83.199     0.962500         3834        26.67
      86.271     0.968750         3859        32.00
      89.855     0.971875         3871        35.56
      92.543     0.975000         3884        40.00
      95.295     0.978125         3896        45.71
      98.815     0.981250         3910        53.33
     103.807     0.984375         3922        64.00
     105.087     0.985938         3927        71.11
     109.055     0.987500         3934        80.00
     109.759     0.989062         3940        91.43
     115.263     0.990625         3946       106.67
     120.575     0.992188         3952       128.00
     123.775     0.992969         3955       142.22
     130.367     0.993750         3959       160.00
     132.351     0.994531         3962       182.86
     136.959     0.995313         3965       213.33
     138.623     0.996094         3968       256.00
     139.007     0.996484         3969       284.44
     140.287     0.996875         3971       320.00
     145.919     0.997266         3973       365.71
     149.247     0.997656         3974       426.67
     156.799     0.998047         3976       512.00
     156.799     0.998242         3976       568.89
     162.175     0.998437         3977       640.00
     176.383     0.998633         3978       731.43
     184.063     0.998828         3979       853.33
     199.935     0.999023         3980      1024.00
     199.935     0.999121         3980      1137.78
     199.935     0.999219         3980      1280.00
     235.647     0.999316         3981      1462.86
     235.647     0.999414         3981      1706.67
     281.343     0.999512         3982      2048.00
     281.343     0.999561         3982      2275.56
     281.343     0.999609         3982      2560.00
     281.343     0.999658         3982      2925.71
     281.343     0.999707         3982      3413.33
     324.607     0.999756         3983      4096.00
     324.607     1.000000         3983          inf
#[Mean    =       12.672, StdDeviation   =       24.931]
#[Max     =      324.352, Total count    =         3983]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  4504 requests in 1.50m, 7.68MB read
Requests/sec:     50.04
Transfer/sec:     87.42KB