evaluation/wrk2_during_switch_20260724_121900.txt
Running 2m test @ http://127.0.0.1:8090
  4 threads and 20 connections
  Thread calibration: mean lat.: 45.610ms, rate sampling interval: 201ms
  Thread calibration: mean lat.: 42.978ms, rate sampling interval: 180ms
  Thread calibration: mean lat.: 46.223ms, rate sampling interval: 201ms
  Thread calibration: mean lat.: 46.947ms, rate sampling interval: 200ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    32.02ms   39.00ms 294.66ms   88.35%
    Req/Sec     7.09     10.17    27.00     75.99%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   17.10ms
 75.000%   38.11ms
 90.000%   78.65ms
 99.000%  184.06ms
 99.900%  259.45ms
 99.990%  294.91ms
 99.999%  294.91ms
100.000%  294.91ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       2.069     0.000000            1         1.00
       5.239     0.100000          232         1.11
       7.271     0.200000          464         1.25
       9.975     0.300000          696         1.43
      12.743     0.400000          927         1.67
      17.103     0.500000         1161         2.00
      20.335     0.550000         1276         2.22
      23.519     0.600000         1391         2.50
      27.711     0.650000         1507         2.86
      32.495     0.700000         1622         3.33
      38.111     0.750000         1738         4.00
      40.799     0.775000         1796         4.44
      45.183     0.800000         1854         5.00
      49.375     0.825000         1912         5.71
      56.511     0.850000         1970         6.67
      65.983     0.875000         2028         8.00
      74.239     0.887500         2057         8.89
      78.783     0.900000         2086        10.00
      89.727     0.912500         2116        11.43
      99.263     0.925000         2144        13.33
     107.327     0.937500         2173        16.00
     111.487     0.943750         2187        17.78
     120.255     0.950000         2202        20.00
     124.927     0.956250         2216        22.86
     134.911     0.962500         2231        26.67
     144.127     0.968750         2245        32.00
     152.063     0.971875         2252        35.56
     154.239     0.975000         2260        40.00
     158.463     0.978125         2267        45.71
     164.991     0.981250         2274        53.33
     171.903     0.984375         2281        64.00
     175.871     0.985938         2285        71.11
     179.327     0.987500         2289        80.00
     181.375     0.989062         2292        91.43
     188.671     0.990625         2296       106.67
     195.967     0.992188         2299       128.00
     199.679     0.992969         2301       142.22
     206.847     0.993750         2303       160.00
     211.967     0.994531         2305       182.86
     226.303     0.995313         2307       213.33
     227.967     0.996094         2308       256.00
     229.887     0.996484         2309       284.44
     235.903     0.996875         2310       320.00
     241.151     0.997266         2311       365.71
     243.967     0.997656         2312       426.67
     250.111     0.998047         2313       512.00
     250.111     0.998242         2313       568.89
     256.767     0.998437         2314       640.00
     256.767     0.998633         2314       731.43
     259.455     0.998828         2315       853.33
     259.455     0.999023         2315      1024.00
     259.455     0.999121         2315      1137.78
     270.847     0.999219         2316      1280.00
     270.847     0.999316         2316      1462.86
     270.847     0.999414         2316      1706.67
     270.847     0.999512         2316      2048.00
     270.847     0.999561         2316      2275.56
     294.911     0.999609         2317      2560.00
     294.911     1.000000         2317          inf
#[Mean    =       32.021, StdDeviation   =       38.999]
#[Max     =      294.656, Total count    =         2317]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  2820 requests in 1.50m, 4.76MB read
  Socket errors: connect 0, read 0, write 0, timeout 320
Requests/sec:     31.31
Transfer/sec:     54.06KB